porousSimpleFoam_OF6/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include "$FOAM_CASE/system/blockMeshDict"

actions
(
{
    name c0;
    type cellZoneSet;
    action new;
    source boxToCell;
    sourceInfo
    {
      box (4.975e-3 0 0) (5.025e-3 0.001 0.001);
     //box (0 0 0) (5e-05 1e-06 1e-06);
    }
}
);

// ************************************************************************* //

// ************************************************************************* //
